In [13]:
import numpy as np
import pandas as pd

# 相关系数与协方差

协方差  
如果有X,Y两个变量，每个时刻的“X值与其均值之差”乘以“Y值与其均值之差”得到一个乘积，再对这每时刻的乘积求和并求出均值。
如果协方差为正，说明X，Y同向变化，协方差越大说明同向程度越高；如果协方差为负，说明X，Y反向运动，协方差越小说明反向程度越高。

In [14]:
df = pd.DataFrame({
    'GDP':[900,1000,1100,1200,1300],
#     'foreign_Trade':[300,400,500,550,600],
#     'foreign_Trade':[300,350,280,250,380],
    'foreign_Trade':[800,700,600,500,400],
    'year':['2012','2013','2014','2015','2016']
})

In [15]:
df.cov()

                   GDP  foreign_Trade
GDP            25000.0       -25000.0
foreign_Trade -25000.0        25000.0

In [16]:
df['GDP'].cov(df['foreign_Trade'])

-25000.0

相关系数
就是用X、Y的协方差除以X的标准差和Y的标准差。所以，相关系数也可以看成协方差：一种剔除了两个变量量纲影响、标准化后的特殊协方差。
1.也可以反映两个变量变化时是同向还是反向，如果同向变化为正，反向变化为负
2.由于它是标准化后的协方差，因此更重的特性是，它消除了两个变量变化幅度的影响，而只是单纯反应两个变量单位变化的相似程度。
注意：
相关系数不像协方差一样可以在＋\infty 到－\infty 间变化，它只能在＋1到－1之间变化
当相关系数为1的时候两者相识度最大，同向正相关
当相关系数为0的时候两者没有任何相似度，两个变量无关
当相关系数为-1的时候两者变化的反向相似度最大，完全反向负相关

In [17]:
df.corr()

               GDP  foreign_Trade
GDP            1.0           -1.0
foreign_Trade -1.0            1.0

In [18]:
df['GDP'].corr(df['foreign_Trade'])

-0.99999999999999978

# 唯一值

unique方法用于获取Series中的唯一值数组(去重数据后的数组)

In [19]:
ser01 = pd.Series(['a','b','c','a','b','c','a'])
ser01

0    a
1    b
2    c
3    a
4    b
5    c
6    a
dtype: object

In [20]:
ser01.unique()

array(['a', 'b', 'c'], dtype=object)

In [21]:
df = pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90],
})
df

  member_id  order_amt order_id
0       a01         80     1001
1       a02         90     1002
2       a03         70     1003
3       a01         79     1004
4       a02         88     1005
5       a03         90     1006

In [22]:
print('下单用户：')
df['member_id'].unique()

下单用户：

array(['a01', 'a02', 'a03'], dtype=object)

# 值计数

In [23]:
#统计每个子集出现的次数
ser01 = pd.Series(['a','b','c','a','b','c','a'])
ser01

0    a
1    b
2    c
3    a
4    b
5    c
6    a
dtype: object

In [24]:
ser01.value_counts()

a    3
b    2
c    2
dtype: int64

In [25]:
ser01.value_counts(ascending = True)

c    2
b    2
a    3
dtype: int64

In [26]:
df = pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90],
})
df

  member_id  order_amt order_id
0       a01         80     1001
1       a02         90     1002
2       a03         70     1003
3       a01         79     1004
4       a02         88     1005
5       a03         90     1006

In [27]:
df['member_id'].value_counts()

a01    2
a03    2
a02    2
Name: member_id, dtype: int64

# 成员资格

In [28]:
ser01 = pd.Series(['a','b','c','a','b','c','a'])
ser01

0    a
1    b
2    c
3    a
4    b
5    c
6    a
dtype: object

In [29]:
#in
mask = ser01.isin(['b','c'])
mask

0    False
1     True
2     True
3    False
4     True
5     True
6    False
dtype: bool

In [30]:
#筛选
ser01[mask]

1    b
2    c
4    b
5    c
dtype: object

In [31]:
mask = ~ser01.isin(['b','c'])
mask

0     True
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [32]:
ser01[mask]

0    a
3    a
6    a
dtype: object

In [33]:
df = pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90],
})
df

  member_id  order_amt order_id
0       a01         80     1001
1       a02         90     1002
2       a03         70     1003
3       a01         79     1004
4       a02         88     1005
5       a03         90     1006

In [34]:
mask = df.isin(['a01',80,'1001'])
mask

   member_id  order_amt  order_id
0       True       True      True
1      False      False     False
2      False      False     False
3       True      False     False
4      False      False     False
5      False      False     False

In [35]:
df[mask]

  member_id  order_amt order_id
0       a01       80.0     1001
1       NaN        NaN      NaN
2       NaN        NaN      NaN
3       a01        NaN      NaN
4       NaN        NaN      NaN
5       NaN        NaN      NaN

# 层次索引

series层次索引

In [36]:
data = pd.Series([100,200,122,150,180],
                 index = [
                     ['2016','2016','2016','2017','2017'],
                     ['苹果','香蕉','西瓜','苹果','西瓜']
                 ])
data

2016  苹果    100
      香蕉    200
      西瓜    122
2017  苹果    150
      西瓜    180
dtype: int64

In [40]:
data['2016']

苹果    100
香蕉    200
西瓜    122
dtype: int64

In [55]:
data[:,'苹果']

2016    100
2017    150
dtype: int64

交换分层索引
swaplevel()

In [56]:
data01 = data.swaplevel().sort_index()
data01

苹果  2016    100
    2017    150
西瓜  2016    122
    2017    180
香蕉  2016    200
dtype: int64

转变为DataFrame 索引的堆

In [57]:
data02 = data.unstack(level = 0 )
 #level等于哪一列 哪一列就消失出现在列里
data02

     2016   2017
苹果  100.0  150.0
西瓜  122.0  180.0
香蕉  200.0    NaN

In [58]:
data02 = data02.stack(level = 0)
data02

苹果  2016    100.0
    2017    150.0
西瓜  2016    122.0
    2017    180.0
香蕉  2016    200.0
dtype: float64

In [59]:
data02.swaplevel().sort_index()

2016  苹果    100.0
      西瓜    122.0
      香蕉    200.0
2017  苹果    150.0
      西瓜    180.0
dtype: float64

DataFrame层次索引

In [60]:
df = pd.DataFrame({
    'year':[2010,2010,2012,2012,2013],
    'fruit':['apple','banana','apple','banana','apple'],
    'production':[2345,3214,5663,2341,3523],
    'profits':[233.44,355.23,566.45,678.56,755.89]
})
df

    fruit  production  profits  year
0   apple        2345   233.44  2010
1  banana        3214   355.23  2010
2   apple        5663   566.45  2012
3  banana        2341   678.56  2012
4   apple        3523   755.89  2013

In [61]:
df = df.set_index(['year','fruit'])
df

             production  profits
year fruit
2010 apple         2345   233.44
     banana        3214   355.23
2012 apple         5663   566.45
     banana        2341   678.56
2013 apple         3523   755.89

In [62]:
df.ix[2010,'apple']
# df.loc[2010,'apple']['production']

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

production    2345.00
profits        233.44
Name: (2010, apple), dtype: float64

按照层次索引进行统计数据

In [63]:
df.mean(level = 'fruit')

         production     profits
fruit
apple   3843.666667  518.593333
banana  2777.500000  516.895000